
let 主題 = "一天掉多少根頭髮"

let 論述 = [
    "現在，解決主題的問題，是非常非常重要的。 所以， ",
    "我們不得不面對一個非常尷尬的事實，那就是， ",
    "主題的發生，到底需要如何做到，不主題的發生，又會如何產生。 ",
    "而這些並不是完全重要，更加重要的問題是， ",
    "主題，到底應該如何實現。 ",
    "帶著這些問題，我們來審視一下主題。 ",
    "所謂主題，關鍵是主題需要如何寫。 ",
    "我們一般認為，抓住了問題的關鍵，其他一切則會迎刃而解。 ",
    "問題的關鍵究竟為何? ",
    "主題因何而發生?",
    "每個人都不得不面對這些問題。  在面對這種問題時， ",
    "一般來講，我們都必須務必慎重的考慮考慮。 ",
    "要想清楚，主題，到底是一種怎麼樣的存在。 ",
    "瞭解清楚主題到底是一種怎麼樣的存在，是解決一切問題的關鍵。 ",
    "就我個人來說，主題對我的意義，不能不說非常重大。 ",
    "本人也是經過了深思熟慮，在每個日日夜夜思考這個問題。 ",
    "主題，發生了會如何，不發生又會如何。 ",
    "在這種困難的抉擇下，本人思來想去，寢食難安。 ",
    "生活中，若主題出現了，我們就不得不考慮它出現了的事實。 ",
    "這種事實對本人來說意義重大，相信對這個世界也是有一定意義的。 ",
    "我們都知道，只要有意義，那麼就必須慎重考慮。 ",
    "既然如此， ",
    "那麼， ",
    "我認為， ",
    "一般來說， ",
    "總結的來說， ",
    "既然如何， ",
    "經過上述討論",
]

let 名人名言 = [
    "伏爾泰曾經說過，不經巨大的困難，不會有偉大的事業。這不禁令我深思",
    "富勒曾經說過，苦難磨煉一些人，也毀滅另一些人。這不禁令我深思",
    "文森特·皮爾曾經說過，改變你的想法，你就改變了自己的世界。這不禁令我深思",
    "拿破崙·希爾曾經說過，不要等待，時機永遠不會恰到好處。這不禁令我深思",
    "塞涅卡曾經說過，生命如同寓言，其價值不在與長短，而在與內容。這不禁令我深思",
    "奧普拉·溫弗瑞曾經說過，你相信什麼，你就成為什麼樣的人。這不禁令我深思",
    "呂凱特曾經說過，生命不可能有兩次，但許多人連一次也不善於度過。這不禁令我深思",
    "莎士比亞曾經說過，人的一生是短的，但如果卑劣地過這一生，就太長了。這不禁令我深思",
    "笛卡兒曾經說過，我的努力求學沒有得到別的好處，只不過是愈來愈發覺自己的無知。這不禁令我深思",
    "左拉曾經說過，生活的道路一旦選定，就要勇敢地走到底，決不回頭。這不禁令我深思",
    "米歇潘曾經說過，生命是一條艱險的峽谷，只有勇敢的人才能通過。這不禁令我深思",
    "吉姆·羅恩曾經說過，要麼你主宰生活，要麼你被生活主宰。這不禁令我深思",
    "日本諺語曾經說過，不幸可能成為通向幸福的橋樑。這不禁令我深思",
    "海貝爾曾經說過，人生就是學校。在那裡，與其說好的教師是幸福，不如說好的教師是不幸。這不禁令我深思",
    "傑納勒爾·喬治·S·巴頓曾經說過，接受挑戰，就可以享受勝利的喜悅。這不禁令我深思",
    "德謨克利特曾經說過，節制使快樂增加並使享受加強。這不禁令我深思",
    "裴斯泰洛齊曾經說過，今天應做的事沒有做，明天再早也是耽誤了。這不禁令我深思",
    "歌德曾經說過，決定一個人的一生，以及整個命運的，只是一瞬之間。這不禁令我深思",
    "卡耐基曾經說過，一個不注意小事情的人，永遠不會成就大事業。這不禁令我深思",
    "盧梭曾經說過，浪費時間是一樁大罪過。這不禁令我深思",
    "康得曾經說過，既然我已經踏上這條道路，那麼，任何東西都不應妨礙我沿著這條路走下去。這不禁令我深思",
    "克勞斯·莫瑟爵士曾經說過，教育需要花費錢，而無知也是一樣。這不禁令我深思",
    "伏爾泰曾經說過，堅持意志偉大的事業需要始終不渝的精神。這不禁令我深思",
    "亞伯拉罕·林肯曾經說過，你活了多少歲不算什麼，重要的是你是如何度過這些歲月的。這不禁令我深思",
    "韓非曾經說過，內外相應，言行相稱。這不禁令我深思",
    "佛蘭克林曾經說過，你熱愛生命嗎？那麼別浪費時間，因為時間是組成生命的材料。這不禁令我深思",
    "瑪律頓曾經說過，堅強的信心，能使平凡的人做出驚人的事業。這不禁令我深思",
    "笛卡兒曾經說過，讀一切好書，就是和許多高尚的人談話。這不禁令我深思",
    "塞涅卡曾經說過，真正的人生，只有在經過艱難卓絕的鬥爭之後才能實現。這不禁令我深思",
    "易蔔生曾經說過，偉大的事業，需要決心，能力，組織和責任感。這不禁令我深思",
    "歌德曾經說過，沒有人事先瞭解自己到底有多大的力量，直到他試過以後才知道。這不禁令我深思",
    "達爾文曾經說過，敢於浪費哪怕一個鐘頭時間的人，說明他還不懂得珍惜生命的全部價值。這不禁令我深思",
    "佚名曾經說過，感激每一個新的挑戰，因為它會鍛造你的意志和品格。這不禁令我深思",
    "奧斯特洛夫斯基曾經說過，共同的事業，共同的鬥爭，可以使人們產生忍受一切的力量。　這不禁令我深思",
    "蘇軾曾經說過，古之立大事者，不惟有超世之才，亦必有堅忍不拔之志。這不禁令我深思",
    "王陽明曾經說過，故立志者，為學之心也；為學者，立志之事也。這不禁令我深思",
    "歌德曾經說過，讀一本好書，就如同和一個高尚的人在交談。這不禁令我深思",
    "烏申斯基曾經說過，學習是勞動，是充滿思想的勞動。這不禁令我深思",
    "別林斯基曾經說過，好的書籍是最貴重的珍寶。這不禁令我深思",
    "佛蘭克林曾經說過，讀書是易事，思索是難事，但兩者缺一，便全無用處。這不禁令我深思",
    "魯巴金曾經說過，讀書是在別人思想的幫助下，建立起自己的思想。這不禁令我深思",
    "培根曾經說過，合理安排時間，就等於節約時間。這不禁令我深思",
    "屠格涅夫曾經說過，你想成為幸福的人嗎？但願你首先學會吃得起苦。這不禁令我深思",
    "莎士比亞曾經說過，拋棄時間的人，時間也拋棄他。這不禁令我深思",
    "叔本華曾經說過，普通人只想到如何度過時間，有才能的人設法利用時間。這不禁令我深思",
    "博曾經說過，一次失敗，只是證明我們成功的決心還夠堅強。 維這不禁令我深思",
    "拉羅什夫科曾經說過，取得成就時堅持不懈，要比遭到失敗時頑強不屈更重要。這不禁令我深思",
    "莎士比亞曾經說過，人的一生是短的，但如果卑劣地過這一生，就太長了。這不禁令我深思",
    "俾斯麥曾經說過，失敗是堅忍的最後考驗。這不禁令我深思",
    "池田大作曾經說過，不要回避苦惱和困難，挺起身來向它挑戰，進而克服它。這不禁令我深思",
    "莎士比亞曾經說過，那腦袋裡的智慧，就像打火石裡的火花一樣，不去打它是不肯出來的。這不禁令我深思",
    "希臘曾經說過，最困難的事情就是認識自己。這不禁令我深思",
    "黑塞曾經說過，有勇氣承擔命運這才是英雄好漢。這不禁令我深思",
    "非洲曾經說過，最靈繁的人也看不見自己的背脊。這不禁令我深思",
    "培根曾經說過，閱讀使人充實，會談使人敏捷，寫作使人精確。這不禁令我深思",
    "斯賓諾莎曾經說過，最大的驕傲於最大的自卑都表示心靈的最軟弱無力。這不禁令我深思",
    "西班牙曾經說過，自知之明是最難得的知識。這不禁令我深思",
    "塞內加曾經說過，勇氣通往天堂，怯懦通往地獄。這不禁令我深思",
    "赫爾普斯曾經說過，有時候讀書是一種巧妙地避開思考的方法。這不禁令我深思",
    "笛卡兒曾經說過，閱讀一切好書如同和過去最傑出的人談話。這不禁令我深思",
    "鄧拓曾經說過，越是沒有本領的就越加自命不凡。這不禁令我深思",
    "愛爾蘭曾經說過，越是無能的人，越喜歡挑剔別人的錯兒。這不禁令我深思",
    "老子曾經說過，知人者智，自知者明。勝人者有力，自勝者強。這不禁令我深思",
    "歌德曾經說過，意志堅強的人能把世界放在手中像泥塊一樣任意揉捏。這不禁令我深思",
    "邁克爾·F·斯特利曾經說過，最具挑戰性的挑戰莫過於提升自我。這不禁令我深思",
    "愛迪生曾經說過，失敗也是我需要的，它和成功對我一樣有價值。這不禁令我深思",
    "羅素·貝克曾經說過，一個人即使已登上頂峰，也仍要自強不息。這不禁令我深思",
    "馬雲曾經說過，最大的挑戰和突破在於用人，而用人最大的突破在於信任人。這不禁令我深思",
    "雷鋒曾經說過，自己活著，就是為了使別人過得更美好。這不禁令我深思",
    "布林沃曾經說過，要掌握書，莫被書掌握；要為生而讀，莫為讀而生。這不禁令我深思",
    "培根曾經說過，要知道對好事的稱頌過於誇大，也會招來人們的反感輕蔑和嫉妒。這不禁令我深思",
    "莫札特曾經說過，誰和我一樣用功，誰就會和我一樣成功。這不禁令我深思",
    "馬克思曾經說過，一切節省，歸根到底都歸結為時間的節省。這不禁令我深思",
    "莎士比亞曾經說過，意志命運往往背道而馳，決心到最後會全部推倒。這不禁令我深思",
    "卡萊爾曾經說過，過去一切時代的精華盡在書中。這不禁令我深思",
    "培根曾經說過，深窺自己的心，而後發覺一切的奇跡在你自己。這不禁令我深思",
    "羅曼·羅蘭曾經說過，只有把抱怨環境的心情，化為上進的力量，才是成功的保證。這不禁令我深思",
    "孔子曾經說過，知之者不如好之者，好之者不如樂之者。這不禁令我深思",
    "達·芬奇曾經說過，大膽和堅定的決心能夠抵得上武器的精良。這不禁令我深思",
    "叔本華曾經說過，意志是一個強壯的盲人，倚靠在明眼的跛子肩上。這不禁令我深思",
    "黑格爾曾經說過，只有永遠躺在泥坑裡的人，才不會再掉進坑裡。這不禁令我深思",
    "普列姆昌德曾經說過，希望的燈一旦熄滅，生活刹那間變成了一片黑暗。這不禁令我深思",
    "維龍曾經說過，要成功不需要什麼特別的才能，只要把你能做的小事做得好就行了。這不禁令我深思",
    "郭沫若曾經說過，形成天才的決定因素應該是勤奮。這不禁令我深思",
    "洛克曾經說過，學到很多東西的訣竅，就是一下子不要學很多。這不禁令我深思",
    "西班牙曾經說過，自己的鞋子，自己知道緊在哪裡。這不禁令我深思",
    "拉羅什福科曾經說過，我們唯一不會改正的缺點是軟弱。這不禁令我深思",
    "亞伯拉罕·林肯曾經說過，我這個人走得很慢，但是我從不後退。這不禁令我深思",
    "美華納曾經說過，勿問成功的秘訣為何，且盡全力做你應該做的事吧。這不禁令我深思",
    "俾斯麥曾經說過，對於不屈不撓的人來說，沒有失敗這回事。這不禁令我深思",
    "阿蔔·日·法拉茲曾經說過，學問是異常珍貴的東西，從任何源泉吸收都不可恥。這不禁令我深思",
    "白哲特曾經說過，堅強的信念能贏得強者的心，並使他們變得更堅強。 這不禁令我深思",
    "查理斯·史考伯曾經說過，一個人幾乎可以在任何他懷有無限熱忱的事情上成功。 這不禁令我深思",
    "貝多芬曾經說過，卓越的人一大優點是：在不利與艱難的遭遇裡百折不饒。這不禁令我深思",
    "莎士比亞曾經說過，本來無望的事，大膽嘗試，往往能成功。這不禁令我深思",
    "卡耐基曾經說過，我們若已接受最壞的，就再沒有什麼損失。這不禁令我深思",
    "德國曾經說過，只有在人群中間，才能認識自己。這不禁令我深思",
    "史美爾斯曾經說過，書籍把我們引入最美好的社會，使我們認識各個時代的偉大智者。這不禁令我深思",
    "馮學峰曾經說過，當一個人用工作去迎接光明，光明很快就會來照耀著他。這不禁令我深思",
    "吉格·金克拉曾經說過，如果你能做夢，你就能實現它。這不禁令我深思",
]

let 後面墊話 = [
    "這不禁令我深思。 ",
    "帶著這句話，我們還要更加慎重的審視這個問題： ",
    "這啟發了我， ",
    "我希望諸位也能好好地體會這句話。 ",
    "這句話語雖然很短，但令我浮想聯翩。 ",
]

let 前面墊話 = [
    "曾經說過",
    "在不經意間這樣說過",
]

function 隨便取一句(列表) {
    let 座標 = Math.floor(Math.random() * 列表.length);
    return 列表[座標];
}

function 隨便取一個數(最小值 = 0, 最大值 = 100) {
    let 數字 = Math.random() * (最大值 - 最小值) + 最小值;
    return 數字;
}

function 來點名人名言() {
    let 名言 = 隨便取一句(名人名言)
    名言 = 名言.replace("曾經說過", 隨便取一句(前面墊話))
    名言 = 名言.replace("這不禁令我深思", 隨便取一句(後面墊話))
    return 名言
}

function 來點論述() {
    let 句子 = 隨便取一句(論述);
    句子 = 句子.replace(RegExp("主題", "g"), 主題);
    return 句子;
}

function 增加段落(章節) {
    if (章節[章節.length - 1] === " ") {
        章節 = 章節.slice(0, -2)
    }
    return "　　" + 章節 + "。 "
}

function 生成文章() {
    let 文章 = []
    for (let 空 in 主題) {
        let 章節 = "";
        let 章節長度 = 0;
        while (章節長度 < 6000) {
            let 亂數 = 隨便取一個數();
            if (亂數 < 5 && 章節.length > 200) {
                章節 = 增加段落(章節);
                文章.push(章節);
                章節 = "";
            } else if (亂數 < 20) {
                let 句子 = 來點名人名言();
                章節長度 = 章節長度 + 句子.length;
                章節 = 章節 + 句子;
            } else {
                let 句子 = 來點論述();
                章節長度 = 章節長度 + 句子.length;
                章節 = 章節 + 句子;
            }
        }
        章節 = 增加段落(章節);
        文章.push(章節);
    }
    return 文章.join("\n");
}

console.log(生成文章())


